ocaml-book/ch2/ex.org
#+include: ../../mytheme.setup




* [[https://cs3110.github.io/textbook/chapters/basics/exercises.html][ch2 ex]]

** values
#+begin_src ocaml
  utop # 7* (1+2+3) ;;
  - : int = 42

  utop # "CS " ^ string_of_int 3110 ;; 
  - : string = "CS 3110"
#+end_src

** operators
#+begin_src ocaml
  utop # 42 * 10 ;;
  - : int = 420

  utop # 3.14 /. 2.0 ;;
  - : float = 1.57


  utop # 4.2 *. 4.2 *. 4.2 *. 4.2 *. 4.2 *. 4.2 *. 4.2 ;;
  - : float = 23053.933324800008
#+end_src

** equality 
#+begin_src ocaml
utop # 42 = 42 ;;
- : bool = true

utop # "hi" = "hi" ;;  structural equality
- : bool = true

utop # "hi" == "hi" ;;  physical equality :compare pointers/addresses
- : bool = false
#+end_src

** assert 
#+begin_src ocaml
  utop # assert true ;;
  - : unit = ()
#+end_src
#+begin_src ocaml
  utop # assert false ;;

  Exception: "Assert_failure //toplevel//:1:0"
  Called from Stdlib__Fun.protect in file "fun.ml", line 33, characters 8-15
  Re-raised at Stdlib__Fun.protect in file "fun.ml", line 38, characters 6-52
  Called from Topeval.load_lambda in file "toplevel/byte/topeval.ml", line 89, characters 4-150
#+end_src

#+begin_src ocaml
utop # assert (2110 != 3110 );;
- : unit = ()
#+end_src

** if
#+begin_src ocaml
utop # if 2 > 1 then 42 else 7 ;;
- : int = 42
#+end_src

** double fun

#+begin_src ocaml
  let double x = 2 * (x) ;;
  
  assert ( (double (-100)) = (-200)) ;
  assert ( 1 =  (double 0));
  assert ( 46 = (double 23)) ;;
#+end_src

** more fun

*** cube

#+begin_src ocaml
let cube x : float  = x *. x *. x ;;
#+end_src

*** sign

#+begin_src ocaml
  let sign x : int  =
    if x > 0 then 1
    else if x = 0 then 0
    else -1
  ;;
#+end_src

