ocaml-book/ch2/ex.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-18 三 20:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="../../org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge8126eb">1. ch2 ex</a>
<ul>
<li><a href="#org14c505c">1.1. values</a></li>
<li><a href="#org846cfec">1.2. operators</a></li>
<li><a href="#org1467878">1.3. equality</a></li>
<li><a href="#org5d7b649">1.4. assert</a></li>
<li><a href="#orgaf8856a">1.5. if</a></li>
<li><a href="#org7c4cd80">1.6. double fun</a></li>
<li><a href="#orgb331954">1.7. more fun</a>
<ul>
<li><a href="#orgd4cc5f0">1.7.1. cube</a></li>
<li><a href="#org16f979e">1.7.2. sign</a></li>
<li><a href="#orgb8ac63c">1.7.3. the area of a circle</a></li>
</ul>
</li>
<li><a href="#org34fca64">1.8. RMS 均方根</a></li>
<li><a href="#org7894bfc">1.9. date fun</a></li>
<li><a href="#org2af2640">1.10. fib</a></li>
<li><a href="#org3f07ef5">1.11. fib fast</a></li>
<li><a href="#orgb87be03">1.12. func type</a></li>
<li><a href="#orgdfbc325">1.13. divide</a></li>
<li><a href="#org2fd1c61">1.14. associativity</a></li>
<li><a href="#orgdec4aa0">1.15. average</a></li>
<li><a href="#org0f867b1">1.16. hello world</a></li>
</ul>
</li>
</ul>
</div>
</div>




<div id="outline-container-orge8126eb" class="outline-2">
<h2 id="orge8126eb"><span class="section-number-2">1.</span> <a href="https://cs3110.github.io/textbook/chapters/basics/exercises.html">ch2 ex</a></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org14c505c" class="outline-3">
<h3 id="org14c505c"><span class="section-number-3">1.1.</span> values</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> 7<span style="color: #f0e68c;">*</span> <span style="color: #f0e68c;">(</span>1<span style="color: #f0e68c;">+</span>2<span style="color: #f0e68c;">+</span>3<span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 42

utop <span style="color: #f0e68c;">#</span> <span style="color: #7bc275;">"CS "</span> <span style="color: #f0e68c;">^</span> string_of_int 3110 <span style="color: #ff4500;">;;</span> 
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> string <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"CS 3110"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org846cfec" class="outline-3">
<h3 id="org846cfec"><span class="section-number-3">1.2.</span> operators</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> 42 <span style="color: #f0e68c;">*</span> 10 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 420

utop <span style="color: #f0e68c;">#</span> 3.14 <span style="color: #f0e68c;">/.</span> 2.0 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> float <span style="color: #f0e68c;">=</span> 1.57


utop <span style="color: #f0e68c;">#</span> 4.2 <span style="color: #f0e68c;">*.</span> 4.2 <span style="color: #f0e68c;">*.</span> 4.2 <span style="color: #f0e68c;">*.</span> 4.2 <span style="color: #f0e68c;">*.</span> 4.2 <span style="color: #f0e68c;">*.</span> 4.2 <span style="color: #f0e68c;">*.</span> 4.2 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> float <span style="color: #f0e68c;">=</span> 23053.933324800008
</pre>
</div>
</div>
</div>

<div id="outline-container-org1467878" class="outline-3">
<h3 id="org1467878"><span class="section-number-3">1.3.</span> equality</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> 42 <span style="color: #f0e68c;">=</span> 42 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> bool <span style="color: #f0e68c;">=</span> <span style="color: #a991f1;">true</span>

utop <span style="color: #f0e68c;">#</span> <span style="color: #7bc275;">"hi"</span> <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"hi"</span> <span style="color: #ff4500;">;;</span>  structural equality
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> bool <span style="color: #f0e68c;">=</span> <span style="color: #a991f1;">true</span>

utop <span style="color: #f0e68c;">#</span> <span style="color: #7bc275;">"hi"</span> <span style="color: #f0e68c;">==</span> <span style="color: #7bc275;">"hi"</span> <span style="color: #ff4500;">;;</span>  physical equality <span style="color: #f0e68c;">:</span>compare pointers<span style="color: #f0e68c;">/</span>addresses
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> bool <span style="color: #f0e68c;">=</span> <span style="color: #a991f1;">false</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d7b649" class="outline-3">
<h3 id="org5d7b649"><span class="section-number-3">1.4.</span> assert</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> <span style="color: #51afef;">assert</span> <span style="color: #a991f1;">true</span> <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> unit <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">()</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> <span style="color: #51afef;">assert</span> <span style="color: #a991f1;">false</span> <span style="color: #ff4500;">;;</span>

<span style="color: #bbc2cf; background-color: #242730;">Exception</span><span style="color: #f0e68c;">:</span> <span style="color: #7bc275;">"Assert_failure //toplevel//:1:0"</span>
<span style="color: #bbc2cf; background-color: #242730;">Called</span> from <span style="color: #FCCE7B;">Stdlib__Fun.</span>protect <span style="color: #f5deb3; font-weight: bold;">in</span> file <span style="color: #7bc275;">"fun.ml"</span><span style="color: #f0e68c;">,</span> line 33<span style="color: #f0e68c;">,</span> characters 8<span style="color: #f0e68c;">-</span>15
<span style="color: #bbc2cf; background-color: #242730;">Re</span><span style="color: #f0e68c;">-</span>raised at <span style="color: #FCCE7B;">Stdlib__Fun.</span>protect <span style="color: #f5deb3; font-weight: bold;">in</span> file <span style="color: #7bc275;">"fun.ml"</span><span style="color: #f0e68c;">,</span> line 38<span style="color: #f0e68c;">,</span> characters 6<span style="color: #f0e68c;">-</span>52
<span style="color: #bbc2cf; background-color: #242730;">Called</span> from <span style="color: #FCCE7B;">Topeval.</span>load_lambda <span style="color: #f5deb3; font-weight: bold;">in</span> file <span style="color: #7bc275;">"toplevel/byte/topeval.ml"</span><span style="color: #f0e68c;">,</span> line 89<span style="color: #f0e68c;">,</span> characters 4<span style="color: #f0e68c;">-</span>150
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> <span style="color: #51afef;">assert</span> <span style="color: #f0e68c;">(</span>2110 <span style="color: #f0e68c;">!=</span> 3110 <span style="color: #f0e68c;">)</span><span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> unit <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">()</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf8856a" class="outline-3">
<h3 id="orgaf8856a"><span class="section-number-3">1.5.</span> if</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-ocaml">utop <span style="color: #f0e68c;">#</span> <span style="color: #51afef;">if</span> 2 <span style="color: #f0e68c;">&gt;</span> 1 <span style="color: #51afef;">then</span> 42 <span style="color: #51afef;">else</span> 7 <span style="color: #ff4500;">;;</span>
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> int <span style="color: #f0e68c;">=</span> 42
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c4cd80" class="outline-3">
<h3 id="org7c4cd80"><span class="section-number-3">1.6.</span> double fun</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">double</span><span style="color: #DFDFDF;"> x</span> <span style="color: #f0e68c;">=</span> 2 <span style="color: #f0e68c;">*</span> <span style="color: #f0e68c;">(</span>x<span style="color: #f0e68c;">)</span> <span style="color: #ff4500;">;;</span>

<span style="color: #51afef;">assert</span> <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">(</span>double <span style="color: #f0e68c;">(-</span>100<span style="color: #f0e68c;">))</span> <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">(-</span>200<span style="color: #f0e68c;">))</span> <span style="color: #f0e68c;">;</span>
<span style="color: #51afef;">assert</span> <span style="color: #f0e68c;">(</span> 1 <span style="color: #f0e68c;">=</span>  <span style="color: #f0e68c;">(</span>double 0<span style="color: #f0e68c;">));</span>
<span style="color: #51afef;">assert</span> <span style="color: #f0e68c;">(</span> 46 <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">(</span>double 23<span style="color: #f0e68c;">))</span> <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb331954" class="outline-3">
<h3 id="orgb331954"><span class="section-number-3">1.7.</span> more fun</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-orgd4cc5f0" class="outline-4">
<h4 id="orgd4cc5f0"><span class="section-number-4">1.7.1.</span> cube</h4>
<div class="outline-text-4" id="text-1-7-1">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">cube</span><span style="color: #DFDFDF;"> x</span> <span style="color: #f0e68c;">:</span> <span style="color: #FCCE7B;">float</span>  <span style="color: #f0e68c;">=</span> x <span style="color: #f0e68c;">*.</span> x <span style="color: #f0e68c;">*.</span> x <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
