ocaml-book/ch2/ex.org
*** the area of a circle

#+begin_src ocaml
  let area_of_circle r : float =
    if r < 0. then failwith "r<0" ;
    ( 3.1415926 *. r *.  r)
  ;;

  let absf x :float =
    if x >= 0. then x
    else (-1.) *.  x
  ;;

  (** [r] is the raduis of a circle *)
  let test_area_of_circle r expected_area =
    assert (absf ((area_of_circle r) -.  expected_area) < 0.01 )
  ;;

  test_area_of_circle 2. 12.56 ;;
#+end_src



** RMS 均方根 

#+begin_src ocaml
let rms x y =  sqrt @@ (x *. x +. y *. y) /. 2. ;;
#+end_src


** date fun

#+begin_src ocaml
  (** [m] should be a month. [d] is day.
      if [m] and [d] is a valid date, then returns true *)
  let date (m:string) ( d:int)  =
    if (  m = "Jan" && d>=1 && d <= 31
	|| m= "Feb" && d>=1 && d <=28
	|| m = "Mar" && d>=1 && d <= 31
	|| m = "Apr" && d>=1 && d < 31
	|| m = "May" && d>=1 && d <= 31
	|| m = "Jun"  && d>=1 && d < 31
	|| m = "Jul" && d>=1 && d <= 31
	|| m = "Aug" && d>=1 && d < 31
	|| m = "Sept" && d>=1 && d <= 31
	|| m = "Oct" && d>=1 && d < 31
	|| m = "Nov" && d>=1 && d <= 31
	|| m = "Dec" && d>=1 && d < 31 )
    then true 
    else false
  ;;

#+end_src



** fib
#+begin_src ocaml
    let rec fib n =
      if n = 1 then 1
      else if n = 2 then 1
      else fib (n-1) + fib (n-2)
  ;;
#+end_src

** fib fast
#+begin_src ocaml
  let rec helper  nstep pp p =
    if nstep = 1 then p
    else helper (nstep-1) p (pp+p )
  ;;

  let fib_fast n = helper n 0 1 ;;
#+end_src

** func type 
#+begin_src ocaml
let f x = if x then x else x  (* bool -> bool *)
let g x y = if y then x else x  (* 'a -> bool -> 'a *)
let h x y z = if x then y else z  (* bool -> 'a -> 'a -> 'a *)
let i x y z = if x then y else y  (* bool -> 'a -> 'b -> 'a *)
#+end_src


