ocaml-book/ch2/ex.html

<div id="outline-container-org16f979e" class="outline-4">
<h4 id="org16f979e"><span class="section-number-4">1.7.2.</span> sign</h4>
<div class="outline-text-4" id="text-1-7-2">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">sign</span><span style="color: #DFDFDF;"> x</span> <span style="color: #f0e68c;">:</span> <span style="color: #FCCE7B;">int</span>  <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> x <span style="color: #f0e68c;">&gt;</span> 0 <span style="color: #51afef;">then</span> 1
  <span style="color: #51afef;">else</span> <span style="color: #51afef;">if</span> x <span style="color: #f0e68c;">=</span> 0 <span style="color: #51afef;">then</span> 0
  <span style="color: #51afef;">else</span> <span style="color: #f0e68c;">-</span>1
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8ac63c" class="outline-4">
<h4 id="orgb8ac63c"><span class="section-number-4">1.7.3.</span> the area of a circle</h4>
<div class="outline-text-4" id="text-1-7-3">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">area_of_circle</span><span style="color: #DFDFDF;"> r</span> <span style="color: #f0e68c;">:</span> <span style="color: #FCCE7B;">float</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> r <span style="color: #f0e68c;">&lt;</span> 0. <span style="color: #51afef;">then</span> <span style="color: #C57BDB;">failwith</span> <span style="color: #7bc275;">"r&lt;0"</span> <span style="color: #f0e68c;">;</span>
  <span style="color: #f0e68c;">(</span> 3.1415926 <span style="color: #f0e68c;">*.</span> r <span style="color: #f0e68c;">*.</span>  r<span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">absf</span><span style="color: #DFDFDF;"> x</span> <span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;">float</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> x <span style="color: #f0e68c;">&gt;=</span> 0. <span style="color: #51afef;">then</span> x
  <span style="color: #51afef;">else</span> <span style="color: #f0e68c;">(-</span>1.<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">*.</span>  x
<span style="color: #ff4500;">;;</span>

<span style="color: #7e7e87;">(** [r] is the raduis of a circle *)</span>
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">test_area_of_circle</span><span style="color: #DFDFDF;"> r expected_area</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">assert</span> <span style="color: #f0e68c;">(</span>absf <span style="color: #f0e68c;">((</span>area_of_circle r<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">-.</span>  expected_area<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">&lt;</span> 0.01 <span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>

test_area_of_circle 2. 12.56 <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org34fca64" class="outline-3">
<h3 id="org34fca64"><span class="section-number-3">1.8.</span> RMS 均方根</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">rms</span><span style="color: #DFDFDF;"> x y</span> <span style="color: #f0e68c;">=</span>  sqrt <span style="color: #f0e68c;">@@</span> <span style="color: #f0e68c;">(</span>x <span style="color: #f0e68c;">*.</span> x <span style="color: #f0e68c;">+.</span> y <span style="color: #f0e68c;">*.</span> y<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">/.</span> 2. <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org7894bfc" class="outline-3">
<h3 id="org7894bfc"><span class="section-number-3">1.9.</span> date fun</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #7e7e87;">(** [m] should be a month. [d] is day.</span>
<span style="color: #7e7e87;">    if [m] and [d] is a valid date, then returns true *)</span>
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">date</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;">m</span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;">string</span><span style="color: #f0e68c;">)</span><span style="color: #DFDFDF;"> </span><span style="color: #f0e68c;">(</span><span style="color: #DFDFDF;"> d</span><span style="color: #f0e68c;">:</span><span style="color: #FCCE7B;">int</span><span style="color: #f0e68c;">)</span>  <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> <span style="color: #f0e68c;">(</span>  m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Jan"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;=</span> 31
      <span style="color: #f0e68c;">||</span> m<span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Feb"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;=</span>28
      <span style="color: #f0e68c;">||</span> m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Mar"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;=</span> 31
      <span style="color: #f0e68c;">||</span> m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Apr"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;</span> 31
      <span style="color: #f0e68c;">||</span> m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"May"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;=</span> 31
      <span style="color: #f0e68c;">||</span> m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Jun"</span>  <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;</span> 31
      <span style="color: #f0e68c;">||</span> m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Jul"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;=</span> 31
      <span style="color: #f0e68c;">||</span> m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Aug"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;</span> 31
      <span style="color: #f0e68c;">||</span> m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Sept"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;=</span> 31
      <span style="color: #f0e68c;">||</span> m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Oct"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;</span> 31
      <span style="color: #f0e68c;">||</span> m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Nov"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;=</span> 31
      <span style="color: #f0e68c;">||</span> m <span style="color: #f0e68c;">=</span> <span style="color: #7bc275;">"Dec"</span> <span style="color: #f0e68c;">&amp;&amp;</span> d<span style="color: #f0e68c;">&gt;=</span>1 <span style="color: #f0e68c;">&amp;&amp;</span> d <span style="color: #f0e68c;">&lt;</span> 31 <span style="color: #f0e68c;">)</span>
  <span style="color: #51afef;">then</span> <span style="color: #a991f1;">true</span> 
  <span style="color: #51afef;">else</span> <span style="color: #a991f1;">false</span>
<span style="color: #ff4500;">;;</span>

</pre>
</div>
</div>
</div>



<div id="outline-container-org2af2640" class="outline-3">
<h3 id="org2af2640"><span class="section-number-3">1.10.</span> fib</h3>
<div class="outline-text-3" id="text-1-10">
<div class="org-src-container">
<pre class="src src-ocaml">  <span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">fib</span><span style="color: #DFDFDF;"> n</span> <span style="color: #f0e68c;">=</span>
    <span style="color: #51afef;">if</span> n <span style="color: #f0e68c;">=</span> 1 <span style="color: #51afef;">then</span> 1
    <span style="color: #51afef;">else</span> <span style="color: #51afef;">if</span> n <span style="color: #f0e68c;">=</span> 2 <span style="color: #51afef;">then</span> 1
    <span style="color: #51afef;">else</span> fib <span style="color: #f0e68c;">(</span>n<span style="color: #f0e68c;">-</span>1<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">+</span> fib <span style="color: #f0e68c;">(</span>n<span style="color: #f0e68c;">-</span>2<span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f07ef5" class="outline-3">
<h3 id="org3f07ef5"><span class="section-number-3">1.11.</span> fib fast</h3>
<div class="outline-text-3" id="text-1-11">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f5deb3; font-weight: bold;">rec</span> <span style="color: #5cEfFF;">helper</span><span style="color: #DFDFDF;">  nstep pp p</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> nstep <span style="color: #f0e68c;">=</span> 1 <span style="color: #51afef;">then</span> p
  <span style="color: #51afef;">else</span> helper <span style="color: #f0e68c;">(</span>nstep<span style="color: #f0e68c;">-</span>1<span style="color: #f0e68c;">)</span> p <span style="color: #f0e68c;">(</span>pp<span style="color: #f0e68c;">+</span>p <span style="color: #f0e68c;">)</span>
<span style="color: #ff4500;">;;</span>

<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">fib_fast</span><span style="color: #DFDFDF;"> n</span> <span style="color: #f0e68c;">=</span> helper n 0 1 <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb87be03" class="outline-3">
<h3 id="orgb87be03"><span class="section-number-3">1.12.</span> func type</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">f</span><span style="color: #DFDFDF;"> x</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">if</span> x <span style="color: #51afef;">then</span> x <span style="color: #51afef;">else</span> x  <span style="color: #62686E;">(* </span><span style="color: #62686E;">bool -&gt; bool</span><span style="color: #62686E;"> *)</span>
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">g</span><span style="color: #DFDFDF;"> x y</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">if</span> y <span style="color: #51afef;">then</span> x <span style="color: #51afef;">else</span> x  <span style="color: #62686E;">(* </span><span style="color: #62686E;">'a -&gt; bool -&gt; 'a</span><span style="color: #62686E;"> *)</span>
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">h</span><span style="color: #DFDFDF;"> x y z</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">if</span> x <span style="color: #51afef;">then</span> y <span style="color: #51afef;">else</span> z  <span style="color: #62686E;">(* </span><span style="color: #62686E;">bool -&gt; 'a -&gt; 'a -&gt; 'a</span><span style="color: #62686E;"> *)</span>
<span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">i</span><span style="color: #DFDFDF;"> x y z</span> <span style="color: #f0e68c;">=</span> <span style="color: #51afef;">if</span> x <span style="color: #51afef;">then</span> y <span style="color: #51afef;">else</span> y  <span style="color: #62686E;">(* </span><span style="color: #62686E;">bool -&gt; 'a -&gt; 'b -&gt; 'a</span><span style="color: #62686E;"> *)</span>
</pre>
</div>
</div>
</div>
