ocaml-book/ch2/ex.org
** divide
Write a function divide : numerator:float -> denominator:float -> float. Apply your function.


#+begin_src ocaml
  let divide numerator denominator =
    if (denominator = 0.) then failwith "divide 0" ;
    numerator /. denominator
    ;;
#+end_src


** associativity
Suppose that we have defined let add x y = x + y.
Which of the following produces an integer, which produces a function,
and which produces an error?
Decide on an answer, then check your answer in the toplevel.
#+begin_src ocaml
add 5 1  --> int
add 5    --> func
(add 5) 1 --> int
add (5 1) --> error
#+end_src



** average
Define an infix operator +/. to compute the average of two floating-point numbers. For example,

1.0 +/. 2.0 = 1.5

0. +/. 0. = 0.

#+begin_src ocaml
  let ( +/. ) a b =
   ( a +. b) /. 2.0
  ;;
#+end_src



** hello world

print_endline "Hello world!";;

print_string "Hello world!";;



#+begin_src ocaml
  print_string "hello world" ;;
  hello world- : unit = ()

  print_endline "hello world" ;;
  hello world
  - : unit = ()
#+end_src
