ocaml-book/ch2/ex.html


<div id="outline-container-orgdfbc325" class="outline-3">
<h3 id="orgdfbc325"><span class="section-number-3">1.13.</span> divide</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Write a function divide : numerator:float -&gt; denominator:float -&gt; float. Apply your function.
</p>


<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #5cEfFF;">divide</span><span style="color: #DFDFDF;"> numerator denominator</span> <span style="color: #f0e68c;">=</span>
  <span style="color: #51afef;">if</span> <span style="color: #f0e68c;">(</span>denominator <span style="color: #f0e68c;">=</span> 0.<span style="color: #f0e68c;">)</span> <span style="color: #51afef;">then</span> <span style="color: #C57BDB;">failwith</span> <span style="color: #7bc275;">"divide 0"</span> <span style="color: #f0e68c;">;</span>
  numerator <span style="color: #f0e68c;">/.</span> denominator
  <span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org2fd1c61" class="outline-3">
<h3 id="org2fd1c61"><span class="section-number-3">1.14.</span> associativity</h3>
<div class="outline-text-3" id="text-1-14">
<p>
Suppose that we have defined let add x y = x + y.
Which of the following produces an integer, which produces a function,
and which produces an error?
Decide on an answer, then check your answer in the toplevel.
</p>
<div class="org-src-container">
<pre class="src src-ocaml">add 5 1  <span style="color: #f0e68c;">--&gt;</span> int
add 5    <span style="color: #f0e68c;">--&gt;</span> func
<span style="color: #f0e68c;">(</span>add 5<span style="color: #f0e68c;">)</span> 1 <span style="color: #f0e68c;">--&gt;</span> int
add <span style="color: #f0e68c;">(</span>5 1<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">--&gt;</span> error
</pre>
</div>
</div>
</div>



<div id="outline-container-orgdec4aa0" class="outline-3">
<h3 id="orgdec4aa0"><span class="section-number-3">1.15.</span> average</h3>
<div class="outline-text-3" id="text-1-15">
<p>
Define an infix operator +/. to compute the average of two floating-point numbers. For example,
</p>

<p>
1.0 +/. 2.0 = 1.5
</p>

<ol class="org-ol">
<li>+/. 0. = 0.</li>
</ol>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #f5deb3; font-weight: bold;">let</span> <span style="color: #f0e68c;">(</span> <span style="color: #f0e68c;">+/.</span> <span style="color: #f0e68c;">)</span> a b <span style="color: #f0e68c;">=</span>
 <span style="color: #f0e68c;">(</span> a <span style="color: #f0e68c;">+.</span> b<span style="color: #f0e68c;">)</span> <span style="color: #f0e68c;">/.</span> 2.0
<span style="color: #ff4500;">;;</span>
</pre>
</div>
</div>
</div>



<div id="outline-container-org0f867b1" class="outline-3">
<h3 id="org0f867b1"><span class="section-number-3">1.16.</span> hello world</h3>
<div class="outline-text-3" id="text-1-16">
<p>
print<sub>endline</sub> "Hello world!";;
</p>

<p>
print<sub>string</sub> "Hello world!";;
</p>



<div class="org-src-container">
<pre class="src src-ocaml">print_string <span style="color: #7bc275;">"hello world"</span> <span style="color: #ff4500;">;;</span>
hello world<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> unit <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">()</span>

print_endline <span style="color: #7bc275;">"hello world"</span> <span style="color: #ff4500;">;;</span>
hello world
<span style="color: #f0e68c;">-</span> <span style="color: #f0e68c;">:</span> unit <span style="color: #f0e68c;">=</span> <span style="color: #f0e68c;">()</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
